Repository: 84000/data-translation-memory
Catalog: toh174-v2.tmx
Source language: bo
Languages: en

source: ཤེས་རབ་ཁྱད་པར་ཅན་དང་ལྡན་ཞིང་རྒྱ་མཚོ་ཆེན་པོ་ལྟར་ཡོན་ཏན་ཚད་མེད་པ་དང་ལྡན་ནོ། །
en: they possess extraordinary insight and immeasurable qualities like a vast ocean.

source: ཤེས་རབ་དེས་ན་ཆོས་ཐམས་ཅད་ཀྱི་སྦྱོར་བ་ལ་ཐོགས་པ་མེད་པར་འགྱུར་རོ། །
en: Through such insight, they will be free of any impediment in their skillful use of all phenomena.

source: གང་ཟག་དེས་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཁམས་གསུམ་ཁོང་དུ་ཆུད་ཅིང་རྟོགས་པས་ཁམས་གསུམ་ལ་སེམས་མི་ཆགས་ཏེ་
en: While such beings use this insight to understand and comprehend the three realms in this way, their minds are not attached to the three realms.

source: ཤེས་རབ་ཁྱད་པར་ཅན་དུ་གྱུར་པས་ཤེས་རབ་ཀྱི་དབང་པོ་དང་། ཤེས་རབ་ཀྱི་སྦྱོར་བ་ཐོབ་པ་ཞེས་བྱའོ། །
en: This extraordinary insight is the attainment of the power of insight and the practice of insight.”

source: འཇིག་རྟེན་འཛིན་ཅིའི་ཕྱིར་དབང་པོ་ཞེས་བྱ་ཞེ་ན།
en: “Lokadhara, why are these called powers ?

source: མཆོག་ཏུ་གྱུར་པའི་ཕྱིར་དབང་པོ་ཞེས་བྱ།
en: They are called powers because they are supreme.

source: མི་གཡོ་བའི་ཕྱིར་དབང་པོ་ཞེས་བྱ།
en: They are called powers because they are unwavering.

source: མི་ཤིགས་པའི་ཕྱིར་དབང་པོ་ཞེས་བྱ།
en: They are called powers because they are indestructible.

source: ཕྱིར་མི་ལྡོག་པའི་ཕྱིར་དབང་པོ་ཞེས་བྱ།
en: They are called powers because they are irreversible.

source: གཞན་གྱི་དྲིང་ལ་མི་འཇོག་པའི་ཕྱིར་དབང་པོ་ཞེས་བྱ།
en: They are called powers because they do not depend on others.

source: མི་འཕྲོགས་པའི་ཕྱིར་དབང་པོ་ཞེས་བྱ།
en: They are called powers because they cannot be taken away.

source: ཡང་དག་པའི་ཆོས་ལ་གཞོལ་བའི་ཕྱིར་དབང་པོ་ཞེས་བྱ།
en: They are called powers because they pursue genuine qualities.

source: མི་ཆགས་པའི་ཕྱིར་དབང་པོ་ཞེས་བྱ།
en: They are called powers because they are unobstructed.

source: མ་བྲལ་བའི་ཕྱིར་དབང་པོ་ཞེས་བྱའོ། །
en: They are called powers because they cannot be lost.

source: གཞན་ཡང་འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་སེམས་ཅན་རྣམས་ཀྱིས་དབང་པོ་ལ་ཤིན་ཏུ་མཁས་པའི་དབང་པོ་རྣམས་ཀྱི་ཁྱད་པར་སློབ་པ་ལ་ཡང་མཁས་པར་བྱེད་དོ། །
en: Moreover, Lokadhara, bodhisattva great beings know well the powers of beings and can therefore act skillfully when training in the various powers.

source: བྱང་ཆུབ་སེམས་དཔས་འདོད་ཆགས་དང་ལྡན་པའི་སེམས་ཀྱི་དབང་པོ་རྣམས་ཀྱང་ཤེས། སེམས་ཅན་འདོད་ཆགས་དང་བྲལ་བའི་དབང་པོ་ཡང་ཤེས།
en: Bodhisattvas understand the powers of beings who have attachment as well as the powers of beings without attachment.

source: སེམས་ཅན་ཞེ་སྡང་དང་ལྡན་པའི་དབང་པོ་ཡང་ཤེས། སེམས་ཅན་ཞེ་སྡང་དང་བྲལ་བའི་དབང་པོ་ཡང་ཤེས།
en: They understand the powers of beings with aversion as well as the powers of beings without aversion.

source: སེམས་ཅན་གཏི་མུག་དང་ལྡན་པའི་དབང་པོ་ཡང་ཤེས། སེམས་ཅན་གཏི་མུག་དང་བྲལ་བའི་དབང་པོ་ཡང་ཤེས།
en: They understand the powers of beings with ignorance as well as the powers of beings without ignorance.

source: སེམས་ཅན་ངན་སོང་དུ་ལྟུང་བར་འགྱུར་བའི་དབང་པོ་ཡང་ཤེས། སེམས་ཅན་ལྷར་སྐྱེ་བ་དང་མིར་སྐྱེ་བའི་དབང་པོ་ཡང་ཤེས།
en: They understand the powers of beings who have fallen to the lower realms as well as the powers of beings who have been born in the god or human realms.

source: སེམས་ཅན་དེས་པའི་སེམས་ཅན་གྱི་དབང་པོ་ཡང་ཤེས། སེམས་ཅན་གྱི་དབང་པོ་རབ་དང་། སེམས་ཅན་གྱི་དབང་པོ་འབྲིང་དང་། སེམས་ཅན་གྱི་དབང་པོ་ཐ་མ་ཡང་ཤེས།
en: They understand the powers of beings who are gentle as well as the powers of beings of the sharpest, middling, and lowest powers.

source: སེམས་ཅན་གྱི་དབང་པོ་ཉམས་པ་དང་། སེམས་ཅན་གྱི་དབང་པོ་མ་ཉམས་པ་ཡང་ཤེས།
en: They understand beings with impaired powers as well as beings with unimpaired powers.

source: སེམས་ཅན་བརྩོན་པ་དང་མི་བརྩོན་པའི་དབང་པོ་ཡང་ཤེས།
en: They understand beings with diligent and lazy powers.

source: སེམས་ཅན་ཐབས་ལ་མཁས་པ་དང་། ཐབས་ལ་མི་མཁས་པ་ཡང་ཤེས།
en: They understand those beings who are skilled and those who are not skilled.

source: སེམས་ཅན་ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པ་དང་། དྲི་མ་དང་བཅས་པ་དང་། དྲི་མ་མེད་པ་དང་། ཞེ་སྡང་དང་བཅས་པ་དང་། ཞེ་སྡང་མེད་པ་དང་། རྗེས་སུ་གཞོལ་བ་དང་། རྗེས་སུ་མི་གཞོལ་བ་དང་། ཐོགས་པ་དང་བཅས་པ་དང་། ཐོགས་པ་མེད་པའི་དབང་པོ་ཡང་ཤེས།
en: They understand the powers of beings who have misdeeds, do not have misdeeds, have stains, are immaculate, have aversion, lack aversion, are compliant, are not compliant, and who are impeded, as well as those who are unimpeded.

source: སེམས་ཅན་གྱི་འདོད་པའི་ཁམས་ཀྱི་འདུ་བྱེད་དང་། གཟུགས་ཡོད་པའི་ཁམས་དང་། གཟུགས་མེད་པའི་ཁམས་ཀྱི་འདུ་བྱེད་ཀྱི་དབང་པོ་ཡང་ཤེས།
en: They understand the powers of beings with formations for the desire realm, the form realm, and the formless realm.

source: སེམས་ཅན་གྱི་དགེ་བའི་རྩ་བ་སྟུག་པ་དང་། དགེ་བའི་རྩ་བ་སྲབ་པ་དང་། ངེས་པ་དང་། མ་ངེས་པ་དང་། ལོག་པར་ངེས་པའི་དབང་པོ་ཡང་ཤེས།
en: They understand the powers of beings with thick roots of virtue and with thin roots of virtue. They understand beings’ powers that are determined, undetermined, and aberrantly determined.

source: སེམས་ཅན་སེར་སྣ་དང་བཅས་པ་དང་། སེར་སྣ་མེད་པ་དང་། རྒོད་པ་དང་། མི་རྒོད་པ་དང་། སླུ་བའི་ཆོས་ཅན་དང་། མི་སླུ་བའི་ཆོས་ཅན་དང་། འཕྱར་བ་དང་། མི་འཕྱར་བ་དང་། ཁྲོ་ཞིང་མི་བཟོད་པ་དང་། དེས་ཤིང་བཟོད་པ་དང་། ཤིན་ཏུ་སེར་སྣ་དང་བཅས་པ་དང་། སྦྱིན་པ་དང་ལྡན་པའི་དབང་པོ་ཡང་ཤེས།
en: They understand the powers of beings who are stingy, not stingy, frivolous, serious, deceptive, not deceptive, exhilarated, not exhilarated, aggressive and impatient, gentle and patient, and miserly or generous.

source: སེམས་ཅན་གྱི་དད་པའི་དབང་པོ་དང་། མ་དད་པའི་དབང་པོ་དང་། བསྟི་སྟང་དང་བཅས་པ་དང་། བསྟི་སྟང་མེད་པ་དང་། ཚུལ་ཁྲིམས་དང་ལྡན་པ་དང་། ཚུལ་ཁྲིམས་རྣམ་པར་མ་དག་པ་དང་། བཟོད་པ་དང་ལྡན་པ་དང་། ལེ་ལོ་དང་བཅས་པ་དང་། བརྩོན་འགྲུས་དང་ལྡན་པ་དང་། སེམས་གཡེང་བ་དང་། སེམས་ཏིང་ངེ་འཛིན་ལ་མཉམ་པར་འཇོག་པ་དང་། འཆལ་བའི་ཤེས་རབ་དང་། ཤེས་རབ་ལྡན་པ་དང་། གླེན་པ་དང་། གླེན་པ་མེད་པ་དང་། ང་རྒྱལ་དང་བཅས་པ་དང་། ང་རྒྱལ་མེད་པ་དང་། ཡང་དག་པའི་ལམ་སྤྱོད་པ་དང་། ལམ་ངན་པ་སྤྱོད་པ་དང་། དྲན་པ་ཉམས་པ་དང་། དྲན་པ་དང་ལྡན་པ་དང་། བློ་དང་ལྡན་པ་དང་། དབང་པོ་འཁྲུགས་པ་དང་། དབང་པོ་སྡུད་པ་དང་། དབང་པོ་ཉམས་པ་དང་། དབང་པོ་མ་ཉམས་པ་དང་། དབང་པོ་མ་དག་པ་དང་། དབང་པོ་དག་པ་དང་། ཐེག་པ་ཆུང་ངུའི་དབང་པོ་དང་། རང་སངས་རྒྱས་ཀྱི་དབང་པོ་དང་། སངས་རྒྱས་ཀྱི་དབང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་དབང་པོ་དང་། བླ་ན་མེད་པའི་བྱང་ཆུབ་ཀྱི་དབང་པོ་ཡང་ཤེས་སོ། །
en: They understand beings’ powers of faith, skepticism, respect, disrespect, discipline, impure discipline, patience, laziness, diligence, distraction, settling into absorption, errancy of knowledge, insightfulness, stupidity, genius, pride, humility, practice of the correct path, practice of the wrong path, carelessness, mindfulness, and intelligence. They understand beings’ powers that are disturbed, withdrawn, impaired, unimpaired, impure, pure, of the lesser vehicle, of the solitary buddhas, of buddhas, of bodhisattvas, and of unsurpassed awakening.

source: བྱང་ཆུབ་སེམས་དཔའ་དེས་དེ་ལྟར་དབང་པོའི་ཁྱད་པར་དང་སྦྱོར་བ་ལས་ཤིན་ཏུ་འདས་པས་
en: “Because these bodhisattvas transcend all such distinct features of the powers and their practices,

source: སེམས་ཅན་དེ་དག་གི་དབང་པོའི་ཁྱད་པར་རྣམ་པར་འབྱེད་པ་ལ་མཁས་པ་ཞེས་བྱའོ། །
en: they are said to be skilled in discerning the distinct features of the powers of beings.

source: ཤེས་རབ་ཀྱིས་གཞན་གྱི་དྲིང་ལ་མི་འཇོག་པའི་ཕྱིར་དབང་པོའི་སྦྱོར་བ་ཐོབ་པ་ཞེས་བྱའོ། །
en: Due to their insight, they do not depend on others, and therefore they are said to attain the practices of the powers.

source: གཞན་གྱིས་མི་འཕྲོགས་པ་ཞེས་བྱ། མི་ཤིགས་པ་ཞེས་བྱ། ཕྱིར་མི་ལྡོག་པ་ཞེས་བྱ། སྦྱོར་བའི་སྟོབས་ཐོབ་པ་ཞེས་བྱ། དབང་པོ་ལ་འཇུག་པ་ཞེས་བྱ། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། མི་དང་། མི་མ་ཡིན་པ་ལ་སོགས་པའི་དབང་པོ་ཐོབ་པ་ཞེས་བྱ། དབང་པོ་མཆོག་ཐོབ་པ་ཞེས་བྱ། མི་འཇིགས་མི་གཡོ་བ་ཐོབ་པ་ཞེས་བྱ། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱ། ཚད་མེད་པའི་ཡོན་ཏན་ལྷུན་གྱིས་གྲུབ་པ་ཞེས་བྱ་སྟེ།
en: Therefore, they are also called those who cannot be taken away by others, those who are indestructible, those who are irreversible, those who attain the strength of application, those who know the powers, those who attain the powers of gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, and nonhumans, those who attain the supreme faculty, those who attain the fearless and unwavering state, those who are perfected, and those who effortlessly accomplish immeasurable qualities.

source: ཆོས་ཐམས་ཅད་ལ་མཐུ་དང་དབང་མྱུར་དུ་ཐོབ་པར་འགྱུར་རོ། །
en: They will swiftly attain power and dominion over all phenomena.”

source: དབང་པོ་ལྔ་ཞེས་བྱ་བའི་ལེའུ་སྟེ་བདུན་ནོ།། །།
en: This was the seventh chapter:“ The Five Powers .”

source: འཇིག་རྟེན་འཛིན་གཞན་ཡང་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་འཕགས་པའི་ལམ་ལ་མཁས་པ་ཞེ་ན།
en: “Lokadhara, how are bodhisattva great beings skilled in the path of the noble ones?

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་འཕགས་པའི་ལམ་ལ་བདེ་བར་གནས་པ་དག་གི་ལམ་ཞེས་བྱ་བ་གང་ཞེ་ན།
en: The bodhisattva great beings are steadfast on the noble path. What is meant by path in this context?

source: འདི་ལྟ་སྟེ། འཕགས་པའི་ལམ་བརྒྱད་དེ། དེ་དག་ཀྱང་ཡང་དག་པའི་ལྟ་བ་དང་། ཡང་དག་པའི་རྟོག་པ་དང་། ཡང་དག་པའི་ངག་དང་། ཡང་དག་པའི་ལས་ཀྱི་མཐའ་དང་། ཡང་དག་པའི་འཚོ་བ་དང་། ཡང་དག་པའི་རྩོལ་བ་དང་། ཡང་དག་པའི་དྲན་པ་དང་། ཡང་དག་པའི་ཏིང་ངེ་འཛིན་ཏོ། །
en: It is the eightfold path of the noble ones, which comprises right view, right thought, right speech, right action, right livelihood, right effort, right mindfulness, and right absorption.

source: འཇིག་རྟེན་འཛིན་དེ་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་འཕགས་པའི་ལམ་གྱི་ཡན་ལག་བརྒྱད་པོ་ལ་སྤྱོད་པ་ནི་གང་འཕགས་པའི་ལམ་གྱི་ཡན་ལག་བརྒྱད་པོ་ལ་སྦྱོར་བ་ཐོབ་པ་གང་ཞེ་ན།
en: Lokadhara, what is it that bodhisattva great beings practice on the eightfold path of the noble ones? And what means do they obtain on the eightfold path of the noble ones?”

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཡང་དག་པའི་ལྟ་བར་གྱུར་པས་ཡང་དག་པར་ལྟ་བ་ལ་བདེ་བར་གནས་ཏེ།
en: “Bodhisattva great beings with right view are steadfast in right view.

source: ལྟ་བ་ཐམས་ཅད་ཡོངས་སུ་གཅད་པའི་ཕྱིར་ལམ་ལ་ནན་ཏན་དུ་བྱེད་དེ།
en: In order to disrupt all views, they exert themselves on the path.

source: ལྟ་བ་ཐམས་ཅད་ཡོངས་སུ་གཅད་པའི་ཕྱིར་ལམ་ལ་བདེ་བར་གནས་ཤིང་མྱ་ངན་ལས་འདས་པར་ལྟ་བ་དང་། སངས་རྒྱས་སུ་ལྟ་བའི་བར་དུ་ཡང་ཡོངས་སུ་གཅོད་དོ། །
en: In order to disrupt all views, they are steadfast on the path and eliminate even their views of nirvāṇa and buddhahood.

source: འཇིག་རྟེན་འཛིན་ཇི་ཙམ་དུ་ལྟ་བར་གྱུར་པ་ཐམས་ཅད་ནི་མྱ་ངན་ལས་འདའ་བར་ལྟ་བ་དང་། སངས་རྒྱས་སུ་ལྟ་བའི་བར་དུ་ཐམས་ཅད་ཀྱང་ངན་པར་ལྟ་བ་སྟེ།
en: Lokadhara, any view, including even views of nirvāṇa and buddhahood, is a negative view.

source: ལྟ་བ་ལ་ཆགས་པ་ཐམས་ཅད་ཡོངས་སུ་འཇིག་ཅིང་གཞོམ་པའི་ཕྱིར་ཡང་དག་པར་ལྟ་བ་ཞེས་བྱའོ། །
en: It is called right view because it destroys and defeats all attachment to views.

source: གཞན་ཡང་ལྟ་བ་མེད་ཅིང་ལྟ་བར་མི་ལེན་པ་དང་། མི་སེམས་པ་དང་། མི་ཆགས་པ་དང་། མི་དམིགས་པ་དང་། མི་སྤྱོད་པ་དང་། ལྟ་བ་ཐམས་ཅད་དུ་རྣམ་པར་མི་རྟོག་པ་ནི་ཡང་དག་པར་ལྟ་བ་ཞེས་བྱའོ། །
en: Furthermore, right view refers to having no view, and not adopting, forming ideas about, becoming attached to, observing, partaking of, or conceptualizing any view.

source: ཡང་དག་པར་ལྟ་བ་དེས་ཅི་མཐོང་ཞེ་ན།
en: “What is seen by right view?

source: འཇིག་རྟེན་འདི་དག་ཐམས་ཅད་ཡང་དག་པ་མ་ཡིན་པའི་ཕྱིན་ཅི་ལོག་ཏུ་ལྟ་བས་ཡོངས་སུ་བཅིངས་པར་མཐོང་ངོ་། །
en: The fact that this entire world is bound by false and mistaken views is seen.

source: དེ་ལྟར་མཐོང་བའི་ཚེ་ན་ལྟ་བ་ཐམས་ཅད་ཡོངས་སུ་གཅད་པ་ལ་བདེ་བར་གནས་པ་ཞེས་བྱའོ། །
en: When this is seen, it is called being steadfast in the disruption of all views .

source: ཡང་དག་པར་ལྟ་བ་དེ་ཉིད་ལ་ཡང་མི་སེམས། མི་ལྟ། མི་ཆགས། རྣམ་པར་མི་རྟོག་སྟེ།
en: Within right view itself, one does not form ideas, view, become attached, or imagine.

source: མྱ་ངན་ལས་འདས་པར་ལྟ་བ་དང་། སངས་རྒྱས་སུ་ལྟ་བའི་བར་དུ་མེད་པ་ནི་ལྟ་བ་ཐམས་ཅད་མི་སྐྱེད་པ་ལ་ནན་ཏན་བྱེད་པའི་ཕྱིར་རོ། །
en: All views up to and including views of nirvāṇa and buddhahood are eliminated, because one exerts oneself in not generating any views.

source: དེ་ལ་ཇི་ལྟར་ན་ཡང་དག་པར་ལྟ་བས་ཆོས་ཐམས་ཅད་རབ་ཏུ་ཞི་བ་དང་། རང་བཞིན་གྱིས་མི་སྐྱེ་མི་འགོག་ཅིང་མྱ་ངན་ལས་འདས་པ་དང་འཐུན་པ་གང་ཞེ་ན།
en: How is it right view? All phenomena are pacified, so conceptualizing characteristics is unborn, unceasing, and in harmony with nirvāṇa.

source: འདི་ལྟར་མི་རྟོག་པ་དང་། རྣམ་པར་མི་རྟོག་པའི་ཆོས་ཐམས་ཅད་ལ་མི་རྟོག་རྣམ་པར་མི་རྟོག་མངོན་སུམ་དུ་བྱེད་པ་ཡང་མ་ཡིན།
en: One thus does not conceptualize or imagine any phenomenon; one does not conceptualize, imagine, or manifest anything.

source: མི་མཐོ། མི་དམའ། མི་ལེན། མི་གཏོང་བ་སྟེ། དེ་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཡང་དག་པར་ལྟ་བ་ཞེས་བྱའོ། །
en: The correct view is not high, not low, not adopting, and not rejecting. This is called right view that transcends the world.

source: དེ་ལ་ཇི་ལྟར་ན་འཇིག་རྟེན་ལས་འདས་པའི་ཡང་དག་པར་ལྟ་བ་གང་ཞེ་ན།
en: “What is meant by right view that transcends the world?

source: གང་འཇིག་རྟེན་དུ་ཡང་མི་དམིགས། འཇིག་རྟེན་ལས་འདས་པར་ཡང་མི་དམིགས། འཇིག་རྟེན་ལས་རྒལ་བར་ཡང་མི་དམིགས་ཏེ། རྣམ་པར་མི་རྟོག་པས་ན་འཇིག་རྟེན་ལས་འདས་པའི་ཡང་དག་པར་ལྟ་བ་ཞེས་བྱའོ། །
en: It is called right view that transcends the world because it does not observe the world and it does not observe the transcendence of the world; and in thus not observing even the transcendence of the world, it is nonconceptual.

source: གཞན་ཡང་ཡང་དག་པར་ལྟ་བ་ཞེས་བྱ་བ་ནི་འཇིག་རྟེན་ལ་ཇི་ལྟར་ཤེས་པ་དང་། མཐོང་བ་ལྟར་འཇིག་རྟེན་ལས་འདས་པ་ཡང་དེ་བཞིན་ཏེ།
en: Furthermore, right view knows and understands the world to be just like the transcendence of the world.

source: གང་འཇིག་རྟེན་དང་། གང་འཇིག་རྟེན་ལས་འདས་པར་ཡང་རྣམ་པར་མི་རྟོག་ཅིང་རྣམ་པར་རྟོག་པའི་འདུ་ཤེས་ཐམས་ཅད་ཡོངས་སུ་གཅད་པའི་ཕྱིར་འཇིག་རྟེན་ལས་འདས་པའི་ཡང་དག་པར་ལྟ་བ་ཞེས་བྱའོ། །
en: It is called right view that transcends the world because it does not conceptualize the world or the transcendence of the world, and because it disrupts all conceptual perceptions.

source: གང་ཞིག་ངན་པར་ཡང་མི་ལྟ་ལ། ཡང་དག་པར་ཡང་མི་ལྟ་ཞིང་སེམས་ཀྱིས་རྟོག་པ་ཐམས་ཅད་ཡོངས་སུ་བཅད་པ་ནི་ཡང་དག་པར་ལྟ་བ་ཞེས་བྱའོ། །
en: It is called right view when one does not see anything in terms of right or wrong and has disrupted all mental concepts.

source: གཞན་ཡང་ཡང་དག་པར་ལྟ་བ་ནི་ཆོས་ཐམས་ཅད་ལ་ཁྱད་པར་མེད་པ་ནི་ཡང་དག་པར་ལྟ་བ་ཞེས་བྱའོ། །
en: Furthermore, right view makes no distinctions between any phenomena: this is right view.

source: གཞན་ཡང་ཡང་དག་པར་ལྟ་བ་ནི་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ངན་པར་ལྟ་བའི་དོན་ཤེས་པའོ། །
en: Moreover, right view accurately understands the meaning of wrong view.

source: གཞན་ཡང་ཡང་དག་པར་ལྟ་བ་ནི་ངན་པར་ལྟ་བ་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་རྟོགས་པ་སྟེ།
en: Also, right view understands all wrong views to be sameness.

source: དེ་དག་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཡང་དག་པར་ལྟ་བ་ལ་བདེ་བར་གནས་པ་ཞེས་བྱའོ། །
en: This is how bodhisattvas are steadfast in right view.”

source: འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཡང་དག་པར་ལྟ་བ་ལ་བདེ་བར་གནས་ནས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཡང་དག་པའི་རྟོག་པ་ཤེས་ཏེ།
en: “Lokadhara, once they are steadfast in right view, bodhisattva great beings accurately understand right thought.

source: དེ་འདི་སྙམ་དུ་ཇི་ཙམ་དུ་རྟོག་པར་གྱུར་པ་ཐམས་ཅད་ལོག་པ་ཡིན་པས་མྱ་ངན་ལས་འདས་པར་རྟོག་པའམ། སངས་རྒྱས་སུ་རྟོག་པའི་བར་དུ་ཐམས་ཅད་ངན་པར་རྟོག་པའོ་སྙམ་དུ་སེམས་སོ། །
en: They think, ‘All thoughts are mistaken. So, even thoughts about nirvāṇa and buddhahood are wrong thoughts.

source: རྣམ་པར་རྟོག་པ་ཡོངས་སུ་བཅད་པ་ནི་ཡང་དག་པར་རྟོག་པ་ཞེས་བྱའོ། །
en: Right thought is the disruption of thought.’

source: རྣམ་པར་མི་རྟོག་པ་ནི་ཡང་དག་པར་རྟོག་པའོ། །
en: Right thought is no thought.

source: རྣམ་པར་རྟོག་པ་དང་བཅས་པ་ནི་རྣམ་པར་རྟོག་པའོ། །
en: Thinking is conceptual.

source: དེ་ལྟར་རྟོག་པ་ཐམས་ཅད་ཀྱི་མཚན་ཉིད་མཐོང་ཞིང་ཤེས་པས་ན་ངན་པར་རྟོག་པ་མེད་དེ།
en: By seeing and understanding the characteristics of all thoughts, wrong thoughts are eliminated.

source: གང་ཟག་དེ་ནི་འདིའམ་གཞན་ཞེས་རྣམ་པར་རྟོག་པར་མི་འགྱུར་རོ། །
en: They will not think about ‘this or that other thing.’

source: དེ་ལྟར་ཡང་དག་པའི་རྟོག་པ་ལ་གནས་པས་ན་ཡང་དག་པར་རྟོག་པའམ་ངན་པར་ཡང་རྣམ་པར་མི་རྟོག་སྟེ།
en: By abiding in right thought in this way, they will not have any thoughts about right thoughts or wrong thoughts.

source: དེ་ལྟར་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་དང་བྲལ་བས་རྣམ་པར་རྟོག་པ་ལས་འདས་ཏེ་ཡང་དག་པའི་རྟོག་པ་ཞེས་བྱའོ། །
en: By being free from all thoughts, they transcend thought. This is right thought .

source: ཡང་དག་པར་རྟོག་པ་ཞེས་བྱ་བ་ནི་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་ལས་ཡང་དག་པ་མ་ཡིན་པ། མི་བདེན་པ། ཕྱིན་ཅི་ལོག་ལས་བྱུང་བར་མཐོང་ཞིང་ཤེས་ཏེ།
en: Right thought is seeing and understanding that all thought arises from falsity, untruth, and mistaken perception;

source: རྣམ་པར་རྟོག་པ་ཐམས་ཅད་ལ་རྣམ་པར་མི་རྟོག་གོ། །
en: it is to not think of any thoughts.

source: དེ་ལྟར་ཡང་དག་པར་རྟོག་པ་ལས་གནས་ནས་ཡང་དག་པའམ་ངན་པར་རྟོག་པ་ལ་མི་དམིགས་ཏེ།
en: When they dwell in right thought in this way, they do not observe right or wrong thoughts;

source: རྣམ་པར་རྟོག་པ་དང་བྲལ་བ། རྣམ་པར་རྟོག་པ་ལས་འདས་པ། རྣམ་པར་རྟོག་པ་ཡོངས་སུ་བཅད་པས་ན་ཡང་དག་པར་རྟོག་པ་ཞེས་བྱའོ། །
en: they are free from thoughts, have transcended thoughts, and have disrupted thoughts. This is right thought.

source: དེ་ལྟར་དེའི་ཚེ་ན་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་ཀྱིས་མ་བཅིངས་ཏེ།
en: At this point, they are no longer bound by any thoughts, and

source: རྣམ་པར་རྟོག་པ་ཐམས་ཅད་ཀྱི་རང་བཞིན་མཉམ་པར་ཤེས་ཤིང་མཐོང་བ་ནི་ཡང་དག་པར་རྟོག་པ་ལས་གནས་པ་ཞེས་བྱའོ། །
en: they understand and see that the nature of all thoughts is sameness. This is abiding in right thought.”

source: འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཡང་དག་པའི་ངག་ལ་རྩོམ་པ་ནི་ཇི་སྙེད་ཀྱི་ཚིག་ཏུ་སྨྲ་བ་ཐམས་ཅད་ཡང་དག་པ་མ་ཡིན་པ། མི་བདེན་པ། ཕྱིན་ཅི་ལོག་ལས་བྱུང་བ། ལོག་པར་རྣམ་པར་བརྟགས་པ། རྒྱུ་དང་རྐྱེན་མང་པོ་ལས་བྱུང་བར་ཤེས་ནས་
en: “Lokadhara, bodhisattva great beings’ practice of right speech is to know that all spoken words are false, untrue, arisen from mistaken perception, incorrectly imputed, and arisen from many causes and conditions. With this understanding

source: འདི་སྙམ་དུ་ཇི་ཙམ་དུ་ཚིག་ཏུ་སྨྲ་བ་ཉིད་ལ་དམིགས་སུ་མེད་དེ
en: they think, ‘All words that are spoken are unobservable.’

source: ཚིག་ཐམས་ཅད་འགགས་ནས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ངག་གི་ལས་ཐམས་ཅད་ཤེས་པ་ནི་ཡང་དག་པའི་ངག་ཅེས་བྱའོ། །
en: This accurate understanding of all actions of speech, which occurs once all words have ceased, is right speech .

source: ཚིག་ཏུ་སྨྲ་བའི་ངག་དེ་ཉིད་ཀྱང་གང་ནས་ཀྱང་མ་འོངས་ལ་གང་དུ་ཡང་མི་འགྲོ་བ་མཐོང་ན་ཡང་དག་པའི་ངག་ཅེས་བྱའོ། །
en: When one sees that the speech of spoken words does not come from anywhere or go anywhere, this is right speech.

source: དེ་ལྟར་དེའི་ཚེ་ན་ཡང་དག་པའི་མཚན་ཉིད་ལ་བདེ་བར་གནས་པས་ཇི་ཙམ་དུ་ཚིག་ཏུ་སྨྲ་བ་ཐམས་ཅད་ཡང་དག་པའི་ངག་ཅེས་བྱའོ། །
en: At this point, by being steadfast in this manner in the correct characteristics of speech, all the words they utter are right speech.

source: དེ་བས་ན་ཡང་དག་པའི་ངག་ལ་བདེ་བར་གནས་ན་དོན་དམ་པའི་རྣམ་པར་དག་པའི་ངག་གི་ལས་ལ་གནས་པ་ཞེས་བྱ་སྟེ།
en: Therefore, when they are steadfast in right speech, they are said to abide in the actions of the ultimate and pure speech.

source: ངག་གི་ལས་ཀྱི་མཚན་ཉིད་ཤེས་ཤིང་མཐོང་བ་དང་། ཚིག་ཏུ་སྨྲ་བའི་ངག་ཐམས་ཅད་ཁོང་དུ་ཆུད་ཅིང་ཚིག་ཏུ་སྨྲ་བ་ཐམས་ཅད་འཁྲུལ་པ་མེད་པས་དེ་བས་ན་ཡང་དག་པའི་ངག་ལ་གནས་པ་ཞེས་བྱའོ། །
en: Abiding in right speech means to see and understand the characteristics of the acts of speech, to understand all spoken words, and to be unconfused about all spoken words.”

source: འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལས་ཐམས་ཅད་ལ་ངན་པ་ལོག་པའི་ལས་སུ་ཤེས་སོ། །
en: “Lokadhara, bodhisattva great beings understand all actions as wrong and mistaken actions.

source: ལས་ཐམས་ཅད་ལ་ཡང་དག་པ་མ་ཡིན་པ། ཅི་ཡང་མེད་པ། མངོན་པར་འདུས་མ་བྱས་པ། མ་བྱུང་བར་ཤེས་སོ། །
en: They understand all actions to be false, nonexistent, unconditioned, and unarisen.

source: ལས་ཐམས་ཅད་ལ་ངེས་པའི་མཚན་ཉིད་མེད་དེ། ལས་ཐམས་ཅད་འགོག་པའི་ཕྱིར་ཡང་དག་པའི་ལས་ཤེས་སོ། །
en: Because all action lacks true characteristics, and because all action has ceased, it is known as right action .

source: ཡང་དག་པའི་ལས་ཞེས་བྱ་བ་ནི་ལས་ངན་པའམ་ལས་ཡང་དག་པར་རྣམ་པར་མི་རྟོག་གོ། །
en: Right action is not conceptualizing actions as right or wrong.

source: ལས་རྣམས་ཀྱི་མཉམ་པ་ཉིད་ལ་ཞུགས་པས་ལོག་པའམ་ཡང་དག་པར་རྣམ་པར་མི་རྟོག་པས་དེའི་ཕྱིར་ཡང་དག་པའི་ལས་ཞེས་བྱའོ། །
en: By understanding the sameness of action, one does not think of it in terms of right or wrong. Therefore, it is right action.

source: ཡང་དག་པའི་ལས་ཞེས་བྱ་བ་ནི་ཁམས་གསུམ་ལ་མ་ཆགས་པའི་དོན་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་ཤིང་མཐོང་བའི་དོན་ཏོ། །
en: Right action means nonattachment to the three realms; it means accurate knowledge and understanding.

source: ཡང་དག་པའི་དེ་ཁོ་ན་ཉིད་ལ་མཉམ་པ་ཉིད་དུ་གྱུར་པས་ཡང་དག་པའམ་ལོག་པར་མི་རྟོག་གོ། །
en: Since actions are sameness within the true nature, they are not conceptualized as right or wrong.

source: བྱང་ཆུབ་སེམས་དཔའ་ད་ལྟར་ཡང་དག་པའི་ལས་ལ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ལས་ཐམས་ཅད་ཤེས་ཤིང་མཐོང་བའི་ཕྱིར་ཆོས་ཐམས་ཅད་མི་ལེན། མི་མཐོང་སྟེ་
en: Because bodhisattvas know and understand all action accurately to be right action in this way, they do not perceive or see any phenomenon.

source: དེ་བས་ན་ཡང་དག་པའི་ལས་ཀྱི་མཐའ་ལ་ནན་ཏན་བྱེད་པ་ཞེས་བྱའོ། །
en: Therefore, they are said to endeavor in the accomplishment of right action.

source: ཡང་དག་པའི་ལས་ལ་ལས་ངན་པ་མེད་དེ།
en: In right action there is no wrong action.

source: ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་ཤིང་མཐོང་བས་ཡང་དག་པའི་ལས་ཀྱི་མཐའ་ལ་གནས་པ་ཞེས་བྱའོ། །
en: Accurately seeing and understanding, one is said to dwell in the accomplishment of right action.”

source: འཇིག་རྟེན་འཛིན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་འཚོ་བ་ཐམས་ཅད་ལ་ལོག་པའི་འཚོ་བར་ཤིན་ཏུ་ཤེས་སོ། །
en: “Lokadhara, bodhisattva great beings understand all forms of livelihood to be wrong livelihood.

source: ཇི་ཙམ་དུ་འཚོ་བའི་མཚན་མ་དང་། ཆོས་ཀྱི་མཚན་མ་དང་། ལེན་པའི་མཚན་མ་ནས་མྱ་ངན་ལས་འདའ་བའི་མཚན་མ་དང་སངས་རྒྱས་ཀྱི་མཚན་མའི་བར་དང་། རྣམ་པར་དག་པ་དང་སངས་རྒྱས་སུ་མཚན་མར་འཛིན་ཏེདེ་ལ་ཚོར་བ་རྣམ་པར་དག་པར་འཛིན་ན་ལོག་པར་འཚོ་བ་ཞེས་བྱའོ། །
en: If one clings to the marks of livelihood, as well as to the marks of phenomena, the marks of appropriation, and so on, up to the marks of nirvāṇa and the marks of buddhahood—thinking that purity and buddhahood have marks—as pure livelihood, then that is wrong livelihood.

source: ཡང་དག་པར་འཚོ་བ་ནི་འཚོ་བའི་ཡོ་བྱད་ལ་ཆགས་པ་ཐམས་ཅད་བཏང་སྟེ་
en: Right livelihood involves giving up all attachment to the articles of livelihood.

source: ཚོང་དཔོགས་ཀྱང་ཡོངས་སུ་བཅད་ནས་
en: Once profit-seeking is eliminated,

source: རྟོག་པ་མེད་ཅིང་སྤྲོས་པ་མེད་ལ་སྤྲོས་པ་ཐམས་ཅད་ལས་འདས་པ་ནི་ཡང་དག་པའི་འཚོ་བ་ཞེས་བྱའོ། །
en: the absence of thoughts, then the absence of concepts, and then the transcendence of all concepts is right livelihood.

source: ཡང་དག་པའི་འཚོ་བ་ལ་ངན་པའི་འཚོ་བའམ། ཡང་དག་པའི་འཚོ་བར་རྣམ་པར་མི་རྟོག་པ་ནི་ཐམས་ཅད་དུ་རྣམ་པར་དག་པའི་འཚོ་བ་འཐོབ་པར་འགྱུར་བས་
en: In not conceptualizing right livelihood as wrong or right livelihood, one gains pure and right livelihood in all respects.

source: དེ་བས་ན་རྣམ་པར་དག་པའི་ཡང་དག་པའི་འཚོ་བ་ཐོབ་པ་ཞེས་བྱའོ། །
en: Therefore, this is the attainment of pure and right livelihood.

source: གཞན་ཡང་འཚོ་བ་ཐམས་ཅད་ནི་ཀུན་ཀྱང་མ་སྐྱེས་པས་ལོག་པའམ་ཡང་དག་པ་མེད་དེ།
en: Furthermore, since all forms of livelihood are unborn, there is no right or wrong.

source: གང་ཟག་དེ་ནི་རྣམ་པར་དག་པའི་འཚོ་བ་ཐོབ་ཅིང་ཡང་དག་པའི་ལམ་ལ་བདེ་བར་གནས་པ་སྤྲོས་པ་མེད་པའོ། །
en: A person who knows this achieves pure livelihood, is steadfast on the right path, and is free of concepts.

source: ཡང་དག་པའི་འཚོ་བ་དེ་ལ་གནས་པས་ཡང་དག་པའི་འཚོ་བ་མི་ལེན་ལོག་པར་འཚོ་བ་མི་སྤོང་སྟེ།
en: When abiding in such right livelihood, one does not take up right livelihood or abandon wrong livelihood.

source: དེ་བས་ན་ཡང་དག་པའི་འཚོ་བ་ལ་གནས་པ་ཞེས་བྱའོ། །
en: Therefore, one is abiding in right livelihood.

source: གང་དེའི་ཚེ་དེ་ལྟར་གྱུར་པ་ནི་ཡང་དག་པ་ལ་གནས་པ་ཞེས་ཀྱང་མི་བྱ། ངན་པ་ལ་གནས་པ་ཞེས་ཀྱང་མི་བྱ་སྟེ།
en: At such time, one is not abiding in what is right or what is wrong.

source: རྣམ་པར་དག་པ་མཉམ་པ་ཉིད་ཀྱི་འཚོ་བ་ཐོབ་སྟེ།
en: One has attained the livelihood of purity and sameness.

source: འཚོ་བའི་མཚན་མ་དང་བྲལ་བས་གཡོ་བ་མེད། མངོན་པར་འདུ་བྱ་བ་མེད། འཚོ་བར་མི་རྟོག །འཚོ་བ་མ་ཡིན་པར་མི་རྟོག་གོ། །
en: Since one is free of any marks of livelihood, one is free of concepts, one does not conceive of anything, and one does not think in terms of livelihood or non-livelihood.

source: དེ་ནི་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཤེས་པ་དང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་མཐོང་བ་སྟེ།
en: This is seeing and understanding things accurately.
